Revit 2026 API

# CurveByPointsUtilsGetHostFace Method

---

Gets the host face to which the CurveElement is added.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static Reference GetHostFace(
	CurveElement curveElem
)
```
```vb
Public Shared Function GetHostFace (
	curveElem As CurveElement
) As Reference
```
```cpp
public:
static Reference^ GetHostFace(
	CurveElement^ curveElem
)
```
```fsharp
static member GetHostFace :
        curveElem : CurveElement -> Reference
```

#### Parameters

curveElem CurveElement
     The CurveElement.

#### Return Value

Reference The host face to which the CurveElement is added, or an empty Reference if the host is not a face.

| Exception | Condition |
| --- | --- |
| ArgumentException | The input CurveElement is not a CurveByPoints. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace